Revit 2027 API
FormattedText.GetItalicStatus(TextRange) Method
 Returns whether All, None or a Mixed set of characters in a given text range are italic.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatStatus GetItalicStatus(
	TextRange textRange
)
Public Function GetItalicStatus (
	textRange As TextRange
) As FormatStatus
public:
FormatStatus GetItalicStatus(
	TextRange^ textRange
)
member GetItalicStatus :
        textRange : TextRange -> FormatStatus
Parameters
textRange TextRange
 The given text range.
Return Value
FormatStatus
 The format status of italic on characters FormatStatus.
Exceptions
Exception | Condition
ArgumentException |  This text range is empty. -or- This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text.
ArgumentNullException |  A non-optional argument was null
Remarks
 This function only returns All or None if the text contains one character. The given text range should not be empty.
See Also
Reference
FormattedText Class
GetItalicStatus Overload
Autodesk.Revit.DB Namespace